1sZayavki/DataProcessors/РабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтол</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1sZayavki/InformationRegisters/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Задачи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДеньРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Передано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтделЗаказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделЗаказчик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заказчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1sZayavki/DataProcessors/РабочийСтол/Forms/Начало/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьВсюФорму();

КонецПроцедуры // ПослеДобавленияЗавершение()


&НаКлиенте
Процедура СуткиРанее(Команда)
	ДеньРаботы  = ДеньРаботы - 86400;
	// Вставить содержимое обработчика.
	ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СуткиПозже(Команда)
	ДеньРаботы  = ДеньРаботы + 86400;
	// Вставить содержимое обработчика.
	ОбновитьФорму(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеньРаботы = ТекущаяДата();
	Список.Параметры.УстановитьЗначениеПараметра("ДеньРаботы", ДеньРаботы);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	МинутРабочихВДень = 8*60;
	ЧасовРабочихВДень = 8;
	
	ОбновитьВсюФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	ОбновитьВсюФорму();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсюФорму()
	Список.Параметры.УстановитьЗначениеПараметра("ДеньРаботы", ДеньРаботы);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Элементы.Список.Обновить();
	
	ТЗзадач = ПолучитьТаблицуЗадачНаДень();
	
	ВыполненоЗаДеньМинут = ТЗзадач.Итог("Минут");
	ВыполненоЗаДеньЧасов = ТЗзадач.Итог("Часов");
	
	ОсталосьЗаДеньМинут = МинутРабочихВДень - ВыполненоЗаДеньМинут;
	ОсталосьЗаДеньЧасов = ЧасовРабочихВДень - ВыполненоЗаДеньЧасов;
	
	НачалоРабочегоДня = (8*60*60) + 15*60;	//8:15
	
	ЗаполненоДоВремени = ДеньРаботы + НачалоРабочегоДня + ВыполненоЗаДеньМинут*60;
	
	КоличествоСекундОбеда = 45*60;
	НачалоОбеда = ДеньРаботы + 13*60*60;
	КонецОбеда = ДеньРаботы + 13*60*60 + 45*60;
	//в 13:00 начало обеда
	
	//если текущий момент заполнения находится в периоде Обеда
	Если ЗаполненоДоВремени >= НачалоОбеда Тогда
		//обед наступил
		//учитывать что есть обед
		ЗаполненоДоВремени = ЗаполненоДоВремени + КоличествоСекундОбеда;
	Иначе
		//не считаем обед - нужно чтобы правльно высчитывало время, до которого заполнены задачи
		//ЗаполненоДоВремени = ЗаполненоДоВремени - КоличествоСекундОбеда;	
	КонецЕсли;
	
	//при убавлении колчества минут в задаче
	//конец обеда 13:45
	
	
	////обед
	//Если ТекущаяДата() >= ДеньРаботы + 13*60*60 Тогда
	//	//обед наступил
	//	//учитывать что есть обед
	//	КоличествоСекундОбеда = 45*60;
	//	ЗаполненоДоВремени = ЗаполненоДоВремени + КоличествоСекундОбеда;
	//
	//КонецЕсли;
	
	//

КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуЗадачНаДень()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи.ДеньРаботы КАК ДеньРаботы,
	|	Задачи.План КАК План,
	|	Задачи.Передано КАК Передано,
	|	Задачи.Задача КАК Задача,
	|	Задачи.ОтделЗаказчик КАК ОтделЗаказчик,
	|	Задачи.Заказчик КАК Заказчик,
	|	Задачи.Статус КАК Статус,
	|	Задачи.Минут КАК Минут,
	|	Задачи.Часов КАК Часов
	|ИЗ
	|	РегистрСведений.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.ДеньРаботы = &ДеньРаботы";
	
	Запрос.УстановитьПараметр("ДеньРаботы", ДеньРаботы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура СегодняПриИзменении(Элемент)
	ОбновитьВсюФорму();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьЗадачи" Тогда
		ОбновитьВсюФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Парам = Новый Структура("ДеньРаботы", ДеньРаботы);
	ОткрытьФорму("РегистрСведений.Задачи.ФормаЗаписи",Парам,,,,,Новый ОписаниеОповещения("ПослеДобавленияЗавершение",ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура Добавить10минутНаСервере(ТекущиеДанные, ДобавитьМинут)
	ПрибавитьВремя = ДобавитьМинут > 0;
	НовоеОкончание = ТекущиеДанные.Окончание + (ДобавитьМинут*60);
	Задачи_м.ДобавитьВремяКЗадаче(ТекущиеДанные.Исполнитель, 
	ТекущиеДанные.ДеньРаботы, 
	ТекущиеДанные.План, 
	ТекущиеДанные.Передано, 
	ТекущиеДанные.Задача, 
	ТекущиеДанные.ОтделЗаказчик, 
	ТекущиеДанные.Заказчик, 
	ТекущиеДанные.Статус, 
	ТекущиеДанные.Минут,
	ТекущиеДанные.Часов,
	ДобавитьМинут,
	ТекущиеДанные.Начало,
	ТекущиеДанные.Окончание,
	НовоеОкончание);  
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить10минут(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Добавить10минутНаСервере(ТекущиеДанные, 10);
	ОбновитьВсюФорму();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Убрать10минут(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Добавить10минутНаСервере(ТекущиеДанные, -10);
	ОбновитьВсюФорму();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЧасНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧас(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Добавить10минутНаСервере(ТекущиеДанные, 60);
	ОбновитьВсюФорму();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УбавитьЧас(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Добавить10минутНаСервере(ТекущиеДанные, -60);
	ОбновитьВсюФорму();
	Элементы.Список.Обновить();
КонецПроцедуры
